[BalanceDefs.M_NoVacancy MissionDefinition]
MissionName="Um Hotel às Escuras"
MissionDescription="Você encontrou o [place]Hotel Happy Pig[-place] abandonado. Scooter lhe pediu para conectar a energia da cidade para que seja possível utilizar novamente o Painel de Trabalhos e as máquinas de vendas do Hotel."
TurnInDescription="O Painel de Trabalhos do Hotel Happy Pig já está funcionando!"
MissionSummary="Restabeleça a corrente de energia do [place]Hotel Happy Pig[-place]."
MissionGiver="Uma nota em Happy Pig"
MissionTurnInLocation="Painel de Trabalhos de Happy Pig"
TeaserText="Que tal um servicinho?"

[BalanceDefs.M_NoVacancy:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride="Conserte a bomba de Southpaw."
MissionDescriptionOverride="O Painel de Trabalhos do [place]Hotel Happy Pig[-place] não está funcionando. Pelo visto não está recebendo energia suficiente da bomba de Southpaw. Procure por peças de reposição para consertar a bomba."

[BalanceDefs.M_NoVacancy:NoVacancy_AfterLadder_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_FindPart1 MissionObjectiveDefinition]
ProgressMessage="Encontre a válvula"

[BalanceDefs.M_NoVacancy:NoVacancy_FindPart2 MissionObjectiveDefinition]
ProgressMessage="Encontre o condensador"

[BalanceDefs.M_NoVacancy:NoVacancy_FindPart3 MissionObjectiveDefinition]
ProgressMessage="Encontre a caixa de marchas"

[BalanceDefs.M_NoVacancy:NoVacancy_FindPart3_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Conserte a bomba de Southpaw."
MissionDescriptionOverride="O Painel de Trabalhos do [place]Hotel Happy Pig[-place] não está funcionando. Pelo visto não está recebendo energia suficiente da bomba de Southpaw. Procure por peças de reposição para consertar a bomba."

[BalanceDefs.M_NoVacancy:NoVacancy_FindPart3_ObjSetEnd MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_KillPrimalBeast MissionObjectiveDefinition]
ProgressMessage="Elimine o Bullymong"

[BalanceDefs.M_NoVacancy:NoVacancy_KillPrimalBeast_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_KillSkags MissionObjectiveDefinition]
ProgressMessage="Elimine alguns Skags para encontrar o condensador"

[BalanceDefs.M_NoVacancy:NoVacancy_KillSkagsObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_OpenDoor MissionObjectiveDefinition]
ProgressMessage="Abra a tampa do condensador"

[BalanceDefs.M_NoVacancy:NoVacancy_OpenDoor_OBjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_Part2FinalObj MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_ScavengeParts MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_ShootDownLadder MissionObjectiveDefinition]
ProgressMessage="Atire na escada"

[BalanceDefs.M_NoVacancy:NoVacancy_ShootDownLadder_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacancy_TurnOnTurbine MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[BalanceDefs.M_NoVacancy:NoVacany_FindPart2_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Conserte a bomba de Southpaw."
MissionDescriptionOverride="O Painel de Trabalhos do [place]Hotel Happy Pig[-place] não está funcionando. Pelo visto não está recebendo energia suficiente da bomba de Southpaw. Procure por peças de reposição para consertar a bomba."

[BalanceDefs.M_NoVacancy:RepairHotelTurbine1 MissionObjectiveDefinition]
ProgressMessage="Substitua a válvula"

[BalanceDefs.M_NoVacancy:RepairHotelTurbine2 MissionObjectiveDefinition]
ProgressMessage="Substitua o condensador"

[BalanceDefs.M_NoVacancy:RepairHotelTurbine3 MissionObjectiveDefinition]
ProgressMessage="Substitua a caixa de marchas"

[BalanceDefs.M_NoVacancy:RepairHotelTurbine_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Conserte a bomba de Southpaw."
MissionDescriptionOverride="O Painel de Trabalhos do [place]Hotel Happy Pig[-place] não está funcionando. Pelo visto não está recebendo energia suficiente da bomba de Southpaw. Procure por peças de reposição para consertar a bomba."

[BalanceDefs.M_NoVacancy:TurnOnTurbine MissionObjectiveDefinition]
ProgressMessage="Coloque em funcionamento a bomba de vapor"

[BalanceDefs.M_NoVacancy:TurnOnTurbine2 MissionObjectiveDefinition]
ProgressMessage="Coloque em funcionamento a bomba de vapor"

